<?xml version="1.0" encoding="utf-8"?>
<?xml-stylesheet type="text/xsl" href="css/feed.xsl"?>
<rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:media="http://search.yahoo.com/mrss/" xmlns:og="http://ogp.me/ns#">
<channel>
<atom:link rel="self" href="http://192.168.1.4/fivefilters/makefulltextfeed.php?url=feed.cnblogs.com%2Fblog%2Fsitehome%2Frss&amp;max=10&amp;links=preserve&amp;exc=" />
<atom:link rel="alternate" title="Source URL" href="http://feed.cnblogs.com/blog/sitehome/rss" />
<atom:link rel="related" title="Subscribe to feed" href="http://www.subtome.com/#/subscribe?feeds=http%3A%2F%2F192.168.1.4%2Ffivefilters%2Fmakefulltextfeed.php%3Furl%3Dfeed.cnblogs.com%252Fblog%252Fsitehome%252Frss%26max%3D10%26links%3Dpreserve%26exc%3D&amp;back=http%3A%2F%2F192.168.1.4%2Ffivefilters%2Fmakefulltextfeed.php%3Furl%3Dfeed.cnblogs.com%252Fblog%252Fsitehome%252Frss%26max%3D10%26links%3Dpreserve%26exc%3D" />
<title>博客园_首页</title>
<link></link>
<description>代码改变世界</description>
<item>
<title>机器学习——dbscan密度聚类 - 大数据技术宅</title>
<link>http://www.cnblogs.com/followees/p/14003340.html</link>
<guid isPermaLink="true" >http://www.cnblogs.com/followees/p/14003340.html</guid>
<description>&lt;p&gt;完整版可关注公众号:大数据技术宅获取&lt;/p&gt;

&lt;p&gt;无需指定簇个数&lt;/p&gt;
&lt;p&gt;对任意形状的稠密数据集都可以聚类，簇的形状可以任意&lt;/p&gt;
&lt;p&gt;擅长寻找离群点（检测任务）&lt;/p&gt;
&lt;p&gt;（2）缺点：&lt;/p&gt;
&lt;p&gt;不适用于样本集密度不均匀、聚类间距相差大的情况&lt;/p&gt;
&lt;p&gt;样本集较大时，聚类收敛时间较长&lt;/p&gt;
&lt;p&gt;参数不好选择（参数对聚类结果的影响较大）&lt;/p&gt;
&lt;p&gt;DBSCAN聚类举例&lt;/p&gt;
&lt;p&gt;（1）生成数据集&lt;/p&gt;
&lt;p&gt;代码：&lt;/p&gt;
&lt;p&gt;1#导入所需python模块&lt;/p&gt;
&lt;p&gt; 2from sklearn.datasets import make_blobs&lt;/p&gt;
&lt;p&gt; 3from sklearn.cluster import DBSCAN&lt;/p&gt;
&lt;p&gt; 4import matplotlib; matplotlib.use('TkAgg')&lt;/p&gt;
&lt;p&gt; 5import matplotlib.pyplot as plt&lt;/p&gt;
&lt;p&gt; 6import numpy as np&lt;/p&gt;
&lt;p&gt; 7#利用生成器生成具有三个簇的合成数据集，共1000个样本点，为方便作图，特征维度这里设为2&lt;/p&gt;
&lt;p&gt; 8X,t=make_blobs(n_samples=1000,n_features=2,centers=[[1.2,1.5],[2.2,1.1],[1.5,2.8]],cluster_std=[[0.3],[0.2],[0.25]],random_state=2020)&lt;/p&gt;
&lt;p&gt; 9#生成样本点的分布图&lt;/p&gt;
&lt;p&gt;10fig=plt.figure(figsize=(8,8))&lt;/p&gt;
&lt;p&gt;11ax=fig.add_subplot(111)&lt;/p&gt;
&lt;p&gt;12ax.scatter(X[:,0],X[:,1])&lt;/p&gt;
&lt;p&gt;13plt.show()&lt;/p&gt;


&lt;p&gt;生成的样本点分布图：&lt;/p&gt;

</description>
<pubDate>Thu, 19 Nov 2020 00:37:00 +0000</pubDate>
<dc:creator>大数据技术宅</dc:creator>
<og:description>完整版可关注公众号:大数据技术宅获取 DBSCAN（Density-Based Spatial Clustering of Applications with Noise，基于密度的有噪应用中的空间聚</og:description>
<dc:language>zh-cn</dc:language>
<dc:format>text/html</dc:format>
<dc:identifier>https://www.cnblogs.com/followees/p/14003340.html</dc:identifier>
</item>
<item>
<title>HotSpot源码分析之C++对象的内存布局 - HotSpot-Researcher</title>
<link>http://www.cnblogs.com/mazhimazhi/p/14003295.html</link>
<guid isPermaLink="true" >http://www.cnblogs.com/mazhimazhi/p/14003295.html</guid>
<description>&lt;p&gt;HotSpot采用了OOP-Klass模型来描述Java类和对象。OOP（Ordinary Object Pointer）指的是普通对象指针，而Klass用来描述对象的具体类型。为了更好理解这个模型，首先要介绍一下C++的内存对象模型和虚函数。&lt;/p&gt;
&lt;h3&gt;1、C++类对象的内存布局&lt;/h3&gt;
&lt;p&gt;我们使用Visual Studio工具来查看C++对象的内存布局，所以需要在当前项目上右键单击选择“属性”后，打开属性页，在配置属性-&amp;gt;C/C++-&amp;gt;命令行下的其它选项文本框中配置如下命令：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
/d1 reportAllClassLayout
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;这样，运行main()函数后就会打印出对应的内存布局。如果想要指定看某个类的内存布局时，可以配置命令： &lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
/d1 reportSingleClassLayoutXXX  // XXX表示类名
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;内存布局的原则，简单来说就是&lt;strong&gt;：成员变量按其被声明的顺序排列，按具体实现所规定的对齐原则在内存地址上对齐。&lt;/strong&gt; &lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
class Base1{
 
public: 
 char        base1_var1; 
 int         base1_var2;

 static int  base1_var3;

 void func(){}  
};
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;输出的布局如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
1&amp;gt;  class Base1      size(8):
1&amp;gt;   +---
1&amp;gt;   0       | base1_var1
1&amp;gt;           | &amp;lt;alignment member&amp;gt; (size=3)
1&amp;gt;   4       | base1_var2
1&amp;gt;   +---
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;根据如上的布局结果可知：&lt;/p&gt;
&lt;p data-change-style-times=&quot;1&quot;&gt;&lt;span data-change-style-times=&quot;1&quot;&gt;（一）类内部的成员变量：&lt;/span&gt;&lt;/p&gt;
&lt;ul data-change-style-times=&quot;1&quot;&gt;&lt;li data-change-style-times=&quot;1&quot;&gt;&lt;span data-change-style-times=&quot;1&quot;&gt;普通的变量要占用内存，按照声明成员的先后顺序进行布局（类内偏移从0开始），但是要注意对齐原则。对于如上实例来说，4个字节包含一个字符（实际占用1个字节，3个字节空着，补对齐），后4个字节包含一个整数。A的指针就指向字符开始字节处。&lt;/span&gt;&lt;/li&gt;
&lt;li data-change-style-times=&quot;1&quot;&gt;&lt;span data-change-style-times=&quot;1&quot;&gt;static修饰的静态变量不占用内容，原因是编译器将其放在全局变量区。&lt;/span&gt;&lt;/li&gt;
&lt;/ul&gt;&lt;p data-change-style-times=&quot;1&quot;&gt;&lt;span data-change-style-times=&quot;1&quot;&gt;（二）类内部的成员函数：&lt;/span&gt;&lt;/p&gt;
&lt;ul data-change-style-times=&quot;1&quot;&gt;&lt;li data-change-style-times=&quot;1&quot;&gt;&lt;span data-change-style-times=&quot;1&quot;&gt;普通函数不占用内存。&lt;/span&gt;&lt;/li&gt;
&lt;li data-change-style-times=&quot;1&quot;&gt;&lt;span data-change-style-times=&quot;1&quot;&gt;虚函数要占用8个字节，用来指定虚拟函数表的入口地址。后面会介绍。&lt;/span&gt;&lt;/li&gt;
&lt;/ul&gt;&lt;p&gt;空类也会占用内存空间的，而且大小是1，原因是C++要求每个实例在内存中都有独一无二的地址。&lt;/p&gt;
&lt;p&gt;下面继续讨论有继承的情况，如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
class Base1{
 
public: 
 char        base1_var1; 
 int         base1_var2;

 static int  base1_var3;

 void func(){}  
};

class Derived1:public Base1{
public:
  int         derived1_var1;
};
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;输出的布局如下：　　&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
1&amp;gt;  class Derived1   size(12):
1&amp;gt;   +---
1&amp;gt;   | +--- (base class Base1)
1&amp;gt;   0       | | base1_var1
1&amp;gt;           | | &amp;lt;alignment member&amp;gt; (size=3)
1&amp;gt;   4       | | base1_var2
1&amp;gt;   | +---
1&amp;gt;   8       | derived1_var1
1&amp;gt;   +---
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;可以看到，子类继承了父类的成员变量，在内存布局上，先是布局了父类的成员变量（父类的内存分布不变），接着布局子类的成员变量。&lt;/p&gt;
&lt;p&gt;在HotSpot中，经常需要计算类本身需要占用的内在大小，只要通过sizeof来计算即可。编写main() 函数来测试：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;35&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
void main(int argc,char *argv[]){
        cout &amp;lt;&amp;lt; &quot;Base1的大小&quot; &amp;lt;&amp;lt; sizeof(Base1) &amp;lt;&amp;lt; endl;
        cout &amp;lt;&amp;lt; &quot;Derived1的大小&quot; &amp;lt;&amp;lt; sizeof(Derived1) &amp;lt;&amp;lt; endl;
        system(&quot;pause&quot;); // 为了让运行程序停止，以便察看结果
}
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;运行后打印结果如下：&lt;/p&gt;
&lt;p&gt;Base1的大小8&lt;br/&gt;Derived1的大小12&lt;/p&gt;
&lt;p&gt;另外在HotSpot中经常做的操作就是计算某个变量的偏移量。例如定义的用来表示Java类的C++类Klass中有如下2个函数： &lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
static ByteSize access_flags_offset(){
  return in_ByteSize(offset_of(Klass, _access_flags));
}
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;其中的_access_flags属性就是定义在Klass中的，通过调用access_flags_offset()来计算这个属性在类中的偏移量。offset_of是一个宏，如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
#define offset_of(klass,field) (size_t)((intx)&amp;amp;(((klass*)16)-&amp;gt;field) - 16)
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;则经过宏替换和格式调整后的方法如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
static ByteSize access_flags_offset(){
  return in_ByteSize((size_t)(
     (intx)&amp;amp;(  ((Klass*)16)-&amp;gt;_access_flags) - 16
  ));
}
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;通过(intx)&amp;amp;(((Klass*)16)-&amp;gt;_access_flags) - 16 方式来计算出具体的偏移量。解释一下这种写法。&lt;/p&gt;
&lt;p&gt;假如定义个变量Klass a; 我们都知道&amp;amp;a表示变量a的首地址，&amp;amp;(a._access_flags)表示变量_access_flags的地址，那么&amp;amp;(a._access_flags)减去&amp;amp;a就得到_access_flags的偏移量。&lt;/p&gt;
&lt;p&gt;((Klass*)16)的地址为16，所以偏移量最终等于&amp;amp;( ((Klass*)16)-&amp;gt;_access_flags)减去16。&lt;/p&gt;
&lt;p&gt;当HotSpot JVM要用一个成员变量的时候，它会根据对象的首地址加上成员的偏移量得到成员变量的地址。当对象的首地址为0时，得到的成员变量地址就是它的偏移量。&lt;/p&gt;
&lt;h3&gt;2、虚函数　　&lt;/h3&gt;
&lt;p&gt;HotSpot采用了OOP-Klass模型来描述Java类和对象。那么为何要设计这样一个一分为二的对象模型呢？因为类和对象本来就不是一个概念，分别使用不同的对象模型描述符合软件开发的设计思想。另外英文注释也说明了其中的一个原因：&lt;/p&gt;
&lt;blockquote readability=&quot;11&quot;&gt;
&lt;p&gt;One reason for the oop/klass dichotomy in the implementation is that we don't want a C++ vtbl pointer in every object. Thus,&lt;br/&gt;normal oops don't have any virtual functions. Instead, they forward all &quot;virtual&quot; functions to their klass, which does have&lt;br/&gt;a vtbl and does the C++ dispatch depending on the object's actual type. (See oop.inline.hpp for some of the forwarding code.)&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;根据注释描述，HotSopt的设计者不想让每个对象中都含有一个vtable（虚函数表），所以就把对象模型拆成klass和oop，其中oop中不含有任何虚函数，而klass就含有虚函数表，可以进行方法分发。&lt;/p&gt;
&lt;p&gt;我们简单介绍一下虚函数是如何影响C++中对象的内存布局的。&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;1、只含有数据成员的对象 &lt;/strong&gt; &lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
class Base1{
 
public: 
int base1_var1; 
int base1_var2; 

};
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;对象的内存布局如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
1&amp;gt;  class Base1      size(8):
1&amp;gt;   +---
1&amp;gt;   0       | base1_var1
1&amp;gt;   4       | base1_var2
1&amp;gt;   +---
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;可以看到，成员变量是按照定义的顺序来保存的，类对象的大小就是所有成员变量的大小之和。　&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;2、没有虚函数的对象&lt;/strong&gt;&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
class Base1{
 
public: 
int base1_var1; 
int base1_var2; 
 
void func(){}  
};
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;C++中有方法的动态分派，就类似于Java中方法的多态。而C++实现动态分派主要就是通过虚函数来完成的，非虚函数在编译时就已经确定调用目标。C++中的虚函数通过关键字virtual来声明，如上函数func()没有virtual关键字，所以是非虚函数。　　&lt;/p&gt;
&lt;p&gt;查看内存布局，如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
1&amp;gt;  class Base1      size(8):
1&amp;gt;   +---
1&amp;gt;   0       | base1_var1
1&amp;gt;   4       | base1_var2
1&amp;gt;   +---
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;非虚函数不会影响内存布局。　&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;3、含有虚函数的对象 &lt;/strong&gt;&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
class Base1{
 
public: 
int base1_var1; 
int base1_var2; 
 
virtual void base1_fun1() {}

};
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;内存布局如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
1&amp;gt;  class Base1      size(16):
1&amp;gt;   +---
1&amp;gt;   0       | {vfptr}
1&amp;gt;   8       | base1_var1
1&amp;gt;  12       | base1_var2
1&amp;gt;   +---
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;在64位环境下，指针占用8字节，而vfptr就是指向虚函数表（vtable）的指针，其类型为void**, 这说明它是一个void*指针。类似于在类Base1中定义了如下类似的伪代码： &lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
void* vtable[1] = {  &amp;amp;Base1::base1_fun1  };

const void**  vfptr = &amp;amp;vtable[0];
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;另外我们还可以看到，虚函数指针vfptr位于所有的成员变量之前。　&lt;/p&gt;
&lt;p&gt;我们在上面的例子中再添加一个虚函数，如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
virtual void base1_fun2() {}
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;内存布局如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;32&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
1&amp;gt;  class Base1      size(16):
1&amp;gt;   +---
1&amp;gt;   0       | {vfptr}
1&amp;gt;   8       | base1_var1
1&amp;gt;  12       | base1_var2
1&amp;gt;   +---
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;可以看到，内存布局无论有一个还是多个虚函数都是一样的，改变的只是vfptr指向的虚函数表中的项。类似于在类Base1中定义了如下类似的伪代码：　&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
void* vtable[] = { &amp;amp;Base1::base1_fun1, &amp;amp;Base1::base1_fun2 };

const void** vfptr = &amp;amp;vtable[0];
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;&lt;strong&gt;4、继承类对象&lt;/strong&gt;&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
class Base1{
 
public:
 
int base1_var1; 
int base1_var2;
 
 
virtual void base1_fun1() {} 
virtual void base1_fun2() {}
 
};
 
 
class Derive1 : public Base1{
 
public:
 
int derive1_var1; 
int derive1_var2;
 
};
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;查看Derive1对象的内存布局，如下： &lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
1&amp;gt;  class Derive1    size(24):
1&amp;gt;   +---
1&amp;gt;   | +--- (base class Base1)
1&amp;gt;   0       | | {vfptr}
1&amp;gt;   8       | | base1_var1
1&amp;gt;  12       | | base1_var2
1&amp;gt;   | +---
1&amp;gt;  16       | derive1_var1
1&amp;gt;  20       | derive1_var2
1&amp;gt;   +---
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;可以看到，基类在上边, 继承类的成员在下边，并且基类的内存布局与之前介绍的一模一样。继续来改造如上的实例，为派生类Derive1添加一个与基本base1_fun1()函数一模一样的虚函数，如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;34&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
class Base1{
 
public:
 
int base1_var1; 
int base1_var2;
 
 
virtual void base1_fun1() {} 
virtual void base1_fun2() {}
 
};
 
 
class Derive1 : public Base1{
 
public:
 
int derive1_var1; 
int derive1_var2;

virtual void base1_fun1() {} // 覆盖基类函数
 
};
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;布局如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
1&amp;gt;  class Derive1    size(24):
1&amp;gt;   +---
1&amp;gt;   | +--- (base class Base1)
1&amp;gt;   0       | | {vfptr}
1&amp;gt;   8       | | base1_var1
1&amp;gt;  12       | | base1_var2
1&amp;gt;   | +---
1&amp;gt;  16       | derive1_var1
1&amp;gt;  20       | derive1_var2
1&amp;gt;   +---
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;基本的布局没变，不过由于发生了虚函数覆盖，所以虚函数表中的内容已经发生了变化，类似于在类Derive1中定义了如下类似的伪代码：　　&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
void* vtable[] = { &amp;amp;Derive1::base1_fun1, &amp;amp;Base1::base1_fun2 };

const void** vfptr = &amp;amp;vtable[0];
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;可以看到，vtable[0]指针指向的是Derive1::base1_fun1()函数。所以当调用Derive1对象的base1_fun1()函数时，会根据虚函数表找到Derive1::base1_fun1()函数进行调用，而当调用Base1对象的base1_fun1()函数时，由于Base1对象的虚函数表中的vtable[0]指针指向Base1::base1_func1()函数，所以会调用Base1::base1_fun1()函数。是不是和Java中方法的多态很像？那么HotSpot虚拟机是怎么实现Java方法的多态呢？我们后续在讲解Java方法时会详细介绍。&lt;/p&gt;
&lt;p&gt;下面继续看虚函数的相关实例，如下：&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;34&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
class Base1{
 
public:
 
int base1_var1; 
int base1_var2;
 
 
virtual void base1_fun1() {} 
virtual void base1_fun2() {}
 
};
 
 
class Derive1 : public Base1{
 
public:
 
int derive1_var1; 
int derive1_var2;

virtual void derive1_fun1() {}
 
};
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;对象的内存布局如下：　&lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;33&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
1&amp;gt;  class Derive1    size(24):
1&amp;gt;   +---
1&amp;gt;   | +--- (base class Base1)
1&amp;gt;   0       | | {vfptr}
1&amp;gt;   8       | | base1_var1
1&amp;gt;  12       | | base1_var2
1&amp;gt;   | +---
1&amp;gt;  16       | derive1_var1
1&amp;gt;  20       | derive1_var2
1&amp;gt;   +---
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;对象的内存布局没有改变，改变的仍然是虚函数表，类似于在类Derive1中定义了如下类似的伪代码： &lt;/p&gt;
&lt;div class=&quot;cnblogs_Highlighter&quot; readability=&quot;34&quot;&gt;
&lt;pre class=&quot;brush:csharp;gutter:false;&quot;&gt;
void* vtable[] = { &amp;amp;Derive1::base1_fun1, &amp;amp;Base1::base1_fun2，&amp;amp;Derive1::derive1_fun1 };

const void** vfptr = &amp;amp;vtable[0];
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;可以看到，在虚函数表中追加了&amp;amp;Derive1::derive1_fun1()函数。　　&lt;/p&gt;
&lt;p&gt;好了，关于对象的布局我们就简单的介绍到这里，因为毕竟不是在研究C++，只要够我们研究HotSpot时使用就够了，更多关于内存布局的知识请参考其它文章或书籍。&lt;/p&gt;
&lt;p&gt;其它文章：&lt;/p&gt;
